KevinBMathew/SensorFusion_ESP8266/src/main.cpp
#include <Adafruit_BME680.h>
#include <Adafruit_SHT4x.h>
#include <Adafruit_SH110X.h>
#include <Arduino.h>
#include <EEPROM.h>
#include <FS.h>
#include <SD.h>
#include <SPI.h>
#include <ESP8266WiFi.h>
#include <cmath>
#include <time.h>
#include <Wire.h>
#include "DFRobot_STS3X.h"

// WiFi credentials - UPDATE THESE
#define WIFI_SSID "Galaxy S3"
#define WIFI_PASSWORD "kevinshotspot"

// NTP Configuration
#define MY_NTP_SERVER "pool.ntp.org"
#define MY_TZ "IST-5:30"

// Hardware Configuration
#define SCREEN_WIDTH 128
#define SCREEN_HEIGHT 64
#define TCA_ADDR 0x70
#define CLEAR_PIN 0
#define SDA_PIN 4
#define SCL_PIN 5

// SD Card pin definitions
#define SD_CS_PIN 15
#define SD_MOSI_PIN 13
#define SD_MISO_PIN 12
#define SD_SCK_PIN 14

// System Configuration
#define EEPROM_SIZE 64
#define NUM_SENSORS 6
#define READINGS_PER_MINUTE 12 // 12 readings * 5s interval = 60s

// --- Kalman Filter and Anomaly Detection Parameters ---
#define WINDOW_SIZE 5
const float DROP_THRESHOLD = 1.5;
const float PROCESS_VAR = 0.01;
const float MEAS_VAR_BME = 0.25 * 0.25;   // 0.0625
const float MEAS_VAR_STS35 = 0.05 * 0.05; // 0.0025
const float MEAS_VAR_SHT45 = 0.05 * 0.05; // 0.0025

// --- Weighted Kalman Filter with Anomaly Detection Class ---
class WeightedKFAnomaly {
private:
    // Filter state
    float x; // State (fused temperature)
    float P; // State variance
    float Q; // Process variance

    // Sensor-specific parameters
    float R_diag[NUM_SENSORS];
    float weights[NUM_SENSORS];

    // Anomaly detection state
    float drop_threshold;
    float sensor_history[NUM_SENSORS][WINDOW_SIZE];
    uint8_t history_index[NUM_SENSORS];
    uint8_t history_count[NUM_SENSORS];
    float prev_valid[NUM_SENSORS];
    bool first_step;

public:
    // Constructor
    WeightedKFAnomaly(float q_val, const float r_vals[], const float w_vals[], float threshold) {
        Q = q_val;
        drop_threshold = threshold;
        memcpy(R_diag, r_vals, sizeof(R_diag));
        memcpy(weights, w_vals, sizeof(weights));
        reset();
    }

    // Reset the filter to its initial state
    void reset() {
        x = 25.0; // Initial temperature estimate
        P = 10.0; // Initial variance
        first_step = true;
        for (int i = 0; i < NUM_SENSORS; i++) {
            prev_valid[i] = 25.0; // Initialize with a reasonable default
            history_index[i] = 0;
            history_count[i] = 0;
            for (int j = 0; j < WINDOW_SIZE; j++) {
                sensor_history[i][j] = 0.0;
            }
        }
    }

private:
    // Internal function to detect and correct anomalies
    void detect_anomalies(const float z[], float z_corrected[]) {
        if (first_step) {
            for (int i = 0; i < NUM_SENSORS; i++) {
                if (!isnan(z[i])) {
                    prev_valid[i] = z[i];
                }
                z_corrected[i] = z[i]; // Use initial reading regardless
            }
            first_step = false;
            return;
        }

        for (int i = 0; i < NUM_SENSORS; i++) {
            if (isnan(z[i])) {
                z_corrected[i] = prev_valid[i]; // Use last good value if current is invalid
                continue;
            }

            float expected_temp;
            if (history_count[i] >= 2) {
                float sum = 0;
                for (int j = 0; j < history_count[i]; j++) {
                    sum += sensor_history[i][j];
                }
                expected_temp = sum / history_count[i];
            } else {
                expected_temp = prev_valid[i];
            }

            float temp_drop = expected_temp - z[i];
            if (temp_drop > drop_threshold) {
                z_corrected[i] = prev_valid[i];
                Serial.printf("ANOMALY Sensor %d: Drop of %.1fC detected. Using %.1fC instead of %.1fC\n", i, temp_drop, prev_valid[i], z[i]);
            } else {
                z_corrected[i] = z[i];
                prev_valid[i] = z[i];

                sensor_history[i][history_index[i]] = z[i];
                history_index[i] = (history_index[i] + 1) % WINDOW_SIZE;
                if (history_count[i] < WINDOW_SIZE) {
                    history_count[i]++;
                }
            }
        }
    }

public:
    // Main filter processing step
    float step(float z[]) {
        float z_corrected[NUM_SENSORS];
        detect_anomalies(z, z_corrected);

        // Prediction
        P += Q;

        // Weighted Update (translates the NumPy vector math)
        float h_dot_h = 0;
        float w2_dot_r = 0;
        for (int i = 0; i < NUM_SENSORS; i++) {
            h_dot_h += weights[i] * weights[i];
            w2_dot_r += weights[i] * weights[i] * R_diag[i];
        }
        float S = P * h_dot_h + w2_dot_r;
        if (S == 0) return x;

        float K[NUM_SENSORS];
        for (int i = 0; i < NUM_SENSORS; i++) {
            K[i] = (P * weights[i]) / S;
        }

        float y[NUM_SENSORS];
        for (int i = 0; i < NUM_SENSORS; i++) {
            y[i] = z_corrected[i] - x;
        }

        float update_val = 0;
        for (int i = 0; i < NUM_SENSORS; i++) {
            update_val += K[i] * (weights[i] * y[i]);
        }
        x += update_val;

        float k_dot_h = 0;
        for (int i = 0; i < NUM_SENSORS; i++) {
            k_dot_h += K[i] * weights[i];
        }
        P -= k_dot_h * P;

        return x;
    }
};

// --- Global object definitions ---
Adafruit_SH1106G display = Adafruit_SH1106G(SCREEN_WIDTH, SCREEN_HEIGHT, &Wire, -1);
Adafruit_BME680 bme;
Adafruit_SHT4x sht4;
DFRobot_STS3X sts(&Wire, STS3X_I2C_ADDRESS_B);

// --- Kalman filter parameters and instance ---
const float R_DIAG[NUM_SENSORS] = {
    MEAS_VAR_BME, MEAS_VAR_BME, MEAS_VAR_STS35,
    MEAS_VAR_SHT45, MEAS_VAR_STS35, MEAS_VAR_SHT45
};
const float SENSOR_WEIGHTS[NUM_SENSORS] = {0.1, 0.1, 0.2, 0.2, 0.2, 0.2};
WeightedKFAnomaly kalmanFilter(PROCESS_VAR, R_DIAG, SENSOR_WEIGHTS, DROP_THRESHOLD);

// --- Minute Averaging Buffers ---
float sensorReadings[NUM_SENSORS][READINGS_PER_MINUTE];
uint8_t readingIndex = 0;

// SD Card and Time variables
bool sdCardAvailable = false;
String csvFileName = "temp_data_27Jun1400hrs_onwards.csv";
time_t now;
tm timeinfo;
bool timeInitialized = false;

// System state variables
volatile bool clearEEPROM = false;
unsigned long lastReadTime = 0;
const unsigned long readInterval = 5000;
unsigned long lastMemCheck = 0;
float fusedMaxTemp = -INFINITY;
float fusedMinTemp = INFINITY;
float currentFusedTemp = 0;
int consecutiveFailures = 0;
int bmeFailCount = 0;
int sht4FailCount = 0;
int sts35FailCount = 0;
float lastValidSHT45Reading[2] = {NAN, NAN};
bool displayNeedsUpdate = true;

// Sensor definition struct
struct SensorPort {
    uint8_t port;
    float (*readFunc)();
    const char* name;
    float maxTemp;
    float minTemp;
    int eepromAddr;
    float correction;
};

// Forward declarations for sensor reading functions
float readBME680();
float readSHT45Port5();
float readSHT45Port7();
float readSTS35();

