KevinBMathew/SensorFusion_ESP8266/src/main.cpp
    if (!isnan(fusedTemp)) {
        csvFile.print(fusedTemp, 2);
    } else {
        csvFile.print("NaN");
    }
    csvFile.println();
    csvFile.close();

    Serial.printf("Data logged to CSV: Fused=%.2f°C\n", fusedTemp);
}

void resetMultiplexer() {
    Serial.println("Resetting I2C multiplexer...");
    Wire.beginTransmission(TCA_ADDR);
    Wire.write(0x00);
    Wire.endTransmission();
    delay(100);
    Wire.beginTransmission(TCA_ADDR);
    if (Wire.endTransmission() == 0) {
        Serial.println("Multiplexer reset successful");
    } else {
        Serial.println("Multiplexer reset failed - hardware issue");
    }
}

bool recoverI2CBus() {
    Serial.println("Starting I2C bus recovery...");
    pinMode(SCL_PIN, INPUT_PULLUP);
    if (digitalRead(SCL_PIN) == LOW) {
        Serial.println("SCL held low - cannot recover");
        return false;
    }
    pinMode(SDA_PIN, INPUT_PULLUP);
    if (digitalRead(SDA_PIN) == LOW) {
        Serial.println("SDA held low - attempting recovery");
        pinMode(SCL_PIN, OUTPUT_OPEN_DRAIN);
        for (int i = 0; i < 9; i++) {
            digitalWrite(SCL_PIN, LOW);
            delayMicroseconds(5);
            digitalWrite(SCL_PIN, HIGH);
            delayMicroseconds(5);
            if (digitalRead(SDA_PIN) == HIGH) break;
        }
        pinMode(SDA_PIN, OUTPUT_OPEN_DRAIN);
        digitalWrite(SDA_PIN, LOW);
        delayMicroseconds(5);
        digitalWrite(SCL_PIN, HIGH);
        delayMicroseconds(2);
        digitalWrite(SDA_PIN, HIGH);
        delayMicroseconds(2);
        pinMode(SDA_PIN, INPUT_PULLUP);
        pinMode(SCL_PIN, INPUT_PULLUP);
    }
    Wire.begin(SDA_PIN, SCL_PIN);
    delay(100);
    resetMultiplexer();
    Serial.println("I2C bus recovery completed");
    return true;
}

bool testMultiplexerChannel(uint8_t channel) {
    Wire.beginTransmission(TCA_ADDR);
    Wire.write(1 << channel);
    return (Wire.endTransmission() == 0);
}

void checkMemory() {
    if (millis() - lastMemCheck > 60000) {
        uint32_t free = ESP.getFreeHeap();
        Serial.printf("Free heap: %u bytes\n", free);
        if (free < 10000) {
            Serial.println("WARNING: Low memory detected!");
        }
        lastMemCheck = millis();
    }
}

void IRAM_ATTR clearEEPROMISR() {
    clearEEPROM = true;
}

void selectPort(uint8_t port) {
    Wire.beginTransmission(TCA_ADDR);
    Wire.write(1 << port);
    Wire.endTransmission();
    delay(50);
}

// --- Sensor Reading Functions ---
float readBME680() {
    if (!bme.begin(0x76)) {
        bmeFailCount++;
        if (bmeFailCount > 5) {
            Serial.println("BME680 multiple failures - attempting I2C recovery");
            recoverI2CBus();
            bmeFailCount = 0;
        }
        return NAN;
    }
    bmeFailCount = 0;
    return bme.readTemperature();
}

float readSHT45Internal(int sensorIndex) {
    if (!sht4.begin()) {
        sht4FailCount++;
        if (sht4FailCount > 5) {
            Serial.println("SHT45 multiple failures - attempting I2C recovery");
            recoverI2CBus();
            sht4FailCount = 0;
        }
        return NAN;
    }
    sht4.setPrecision(SHT4X_HIGH_PRECISION);
    sht4.setHeater(SHT4X_NO_HEATER);
    sensors_event_t humidity, temp;
    for (int retry = 0; retry < 3; retry++) {
        sht4.getEvent(&humidity, &temp);
        float temperature = temp.temperature;
        if (temperature != 0.0 && temperature > -40.0 && temperature < 85.0) {
            sht4FailCount = 0;
            lastValidSHT45Reading[sensorIndex] = temperature;
            return temperature;
        }
    }
    if (!isnan(lastValidSHT45Reading[sensorIndex])) {
        Serial.printf("SHT45 failed all retries, using previous valid reading: %.2f°C\n", lastValidSHT45Reading[sensorIndex]);
        return lastValidSHT45Reading[sensorIndex];
    }
    return NAN;
}

float readSHT45Port5() { return readSHT45Internal(0); }
float readSHT45Port7() { return readSHT45Internal(1); }

float readSTS35() {
    int i = 0;
    while(sts.begin() != true) {
        Serial.println("STS35 init failed");
        delay(100);
        i++;
        if(i == 2) {
            sts35FailCount++;
            if (sts35FailCount > 5) {
                Serial.println("STS35 multiple failures - attempting I2C recovery");
                recoverI2CBus();
                sts35FailCount = 0;
            }
            return NAN;
        }
    }
    sts35FailCount = 0;
    sts.setFreq(sts.e10Hz);
    return sts.getTemperaturePeriodC();
}

// --- Display and EEPROM Functions ---
void updateDisplay() {
    display.clearDisplay();
    display.setTextSize(1);
    display.setTextColor(SH110X_WHITE);
    display.setCursor(0, 0);
    if (timeInitialized) {
        String timeStr = getFormattedTime();
        int spaceIndex = timeStr.indexOf(' ');
        if (spaceIndex > 0) {
            display.print(timeStr.substring(spaceIndex + 1));
        } else {
            display.print("Time Error");
        }
    } else {
        display.print("No Time Sync");
    }

    for(int i = 0; i < NUM_SENSORS; i++) {
        int x = 0;
        int y = 10 + (i * 8);
        display.setCursor(x, y);
        if (sensors[i].maxTemp != -INFINITY && sensors[i].minTemp != INFINITY) {
            char buffer[32];
            snprintf(buffer, sizeof(buffer), "%s:%.1f/%.1f",
                sensors[i].name, sensors[i].maxTemp, sensors[i].minTemp);
            display.print(buffer);
        } else {
            display.printf("%s: --/--", sensors[i].name);
        }
    }

    display.setCursor(0, 58);
    if (fusedMaxTemp != -INFINITY && fusedMinTemp != INFINITY) {
        char buffer[32];
        snprintf(buffer, sizeof(buffer), "Fused:%.2f/%.2f", fusedMaxTemp, fusedMinTemp);
        display.print(buffer);
    } else {
        display.print("Fused: --/--");
    }
    display.display();
    displayNeedsUpdate = false;
}

void clearAllEEPROM() {
    Serial.println("Clearing EEPROM...");
    for (int i = 0; i < EEPROM_SIZE; i++) {
        EEPROM.write(i, 0);
    }
    EEPROM.commit();
    for (auto& sensor : sensors) {
        sensor.maxTemp = -INFINITY;
        sensor.minTemp = INFINITY;
    }
    fusedMaxTemp = -INFINITY;
    fusedMinTemp = INFINITY;
    
    kalmanFilter.reset();
    
    // Clear averaging buffers
    readingIndex = 0;
    for (int i = 0; i < NUM_SENSORS; i++) {
        for (int j = 0; j < READINGS_PER_MINUTE; j++) {
            sensorReadings[i][j] = 0.0f;
        }
    }

    consecutiveFailures = 0;
    bmeFailCount = 0;
    sht4FailCount = 0;
    sts35FailCount = 0;
    displayNeedsUpdate = true;
    updateDisplay();
    Serial.println("EEPROM cleared successfully!");
}

bool updateEEPROM(SensorPort &sensor, float temp) {
    bool updated = false;
    if (temp > sensor.maxTemp) {
        sensor.maxTemp = temp;
        EEPROM.put(sensor.eepromAddr, temp);
        updated = true;
        Serial.printf("New MAX extreme for %s: %.2f°C\n", sensor.name, temp);
    }
    if (temp < sensor.minTemp) {
        sensor.minTemp = temp;
        EEPROM.put(sensor.eepromAddr + 4, temp);
        updated = true;
        Serial.printf("New MIN extreme for %s: %.2f°C\n", sensor.name, temp);
    }
    if (updated) {
        EEPROM.commit();
        displayNeedsUpdate = true;
    }
    return updated;
}

bool updateFusedEEPROM(float temp) {
    bool updated = false;
    if (temp > fusedMaxTemp) {
        fusedMaxTemp = temp;
        EEPROM.put(48, temp);
        updated = true;
        Serial.printf("New MAX extreme for Fused: %.2f°C\n", temp);
    }
    if (temp < fusedMinTemp) {
        fusedMinTemp = temp;
        EEPROM.put(52, temp);
        updated = true;
        Serial.printf("New MIN extreme for Fused: %.2f°C\n", temp);
    }
    if (updated) {
        EEPROM.commit();
        displayNeedsUpdate = true;
    }
    return updated;
}

