KevinBMathew/SensorFusion_ESP8266/src/main.cpp
void printExtremes() {
    Serial.println("\nStored Extremes:");
    for (auto& sensor : sensors) {
        Serial.printf("[%s] Max: %.2f°C Min: %.2f°C\n",
            sensor.name, sensor.maxTemp, sensor.minTemp);
    }
    Serial.printf("[Fused] Max: %.2f°C Min: %.2f°C\n", fusedMaxTemp, fusedMinTemp);
    Serial.println();
}

// --- Setup Function ---
void setup() {
    Serial.begin(115200);
    ESP.wdtEnable(8000);
    sdCardAvailable = initSDCard();
    if (sdCardAvailable) {
        Serial.println("SD card ready for data logging");
    } else {
        Serial.println("Continuing without SD card logging");
    }
    initWiFi();
    Wire.begin(SDA_PIN, SCL_PIN);
    delay(100);
    resetMultiplexer();
    display.begin(0x3C);
    display.clearDisplay();
    display.display();
    EEPROM.begin(EEPROM_SIZE);
    pinMode(CLEAR_PIN, INPUT_PULLUP);
    attachInterrupt(digitalPinToInterrupt(CLEAR_PIN), clearEEPROMISR, FALLING);
    
    // Initialize averaging buffer
    for (int i = 0; i < NUM_SENSORS; i++) {
        for (int j = 0; j < READINGS_PER_MINUTE; j++) {
            sensorReadings[i][j] = 0.0f;
        }
    }

    for (auto& sensor : sensors) {
        EEPROM.get(sensor.eepromAddr, sensor.maxTemp);
        EEPROM.get(sensor.eepromAddr + 4, sensor.minTemp);
        if (isnan(sensor.maxTemp)) sensor.maxTemp = -INFINITY;
        if (isnan(sensor.minTemp)) sensor.minTemp = INFINITY;
    }

    EEPROM.get(48, fusedMaxTemp);
    EEPROM.get(52, fusedMinTemp);
    if (isnan(fusedMaxTemp)) fusedMaxTemp = -INFINITY;
    if (isnan(fusedMinTemp)) fusedMinTemp = INFINITY;
    
    updateDisplay();
    Serial.println("Press and release the FLASH button to clear EEPROM");
    Serial.println("Serial commands: 'r' - show extremes, 's' - SD card status, 't' - show time");
}

// --- Main Loop with Minute Averaging ---
void loop() {
    ESP.wdtFeed();
    unsigned long currentTime = millis();
    checkMemory();

    if (clearEEPROM) {
        clearEEPROM = false;
        clearAllEEPROM();
        delay(500);
    }

    if (Serial.available()) {
        char cmd = Serial.read();
        if (cmd == 'r') { printExtremes(); }
        else if (cmd == 's') {
            if (sdCardAvailable) {
                File csvFile = SD.open(csvFileName);
                if (csvFile) {
                    Serial.printf("CSV file size: %u bytes\n", csvFile.size());
                    csvFile.close();
                }
            } else {
                Serial.println("SD card not available");
            }
        }
        else if (cmd == 't') { printCurrentTime(); }
    }

    if (currentTime - lastReadTime >= readInterval) {
        lastReadTime = currentTime;

        Serial.println("----------------------------------------");
        Serial.printf("Collecting readings %d/%d for minute average...\n", readingIndex + 1, READINGS_PER_MINUTE);

        int currentCycleFailures = 0;
        for (int i = 0; i < NUM_SENSORS; i++) {
            selectPort(sensors[i].port);
            float rawTemp = sensors[i].readFunc();
            if (!isnan(rawTemp)) {
                float correctedTemp = rawTemp + sensors[i].correction;
                sensorReadings[i][readingIndex] = correctedTemp; // Store reading in buffer
                Serial.printf("  [Port %d] %s: %.2f°C\n", sensors[i].port, sensors[i].name, correctedTemp);
            } else {
                sensorReadings[i][readingIndex] = NAN; // Store NAN if read fails
                Serial.printf("  [Port %d] %s: Error reading\n", sensors[i].port, sensors[i].name);
                currentCycleFailures++;
            }
        }
        
        if (currentCycleFailures == NUM_SENSORS) {
            consecutiveFailures++;
        } else {
            consecutiveFailures = 0;
        }

        readingIndex++; // Increment the index for the next reading cycle

        // --- Minute-End Processing: Triggered when buffer is full ---
        if (readingIndex >= READINGS_PER_MINUTE) {
            Serial.println("\n*** One minute elapsed. Calculating averages and fusing data... ***");

            // Step 1: Calculate the average for each sensor over the last minute
            float minuteAverages[NUM_SENSORS];
            for (int i = 0; i < NUM_SENSORS; i++) {
                float sum = 0;
                int validReadingCount = 0;
                for (int j = 0; j < READINGS_PER_MINUTE; j++) {
                    if (!isnan(sensorReadings[i][j])) {
                        sum += sensorReadings[i][j];
                        validReadingCount++;
                    }
                }
                if (validReadingCount > 0) {
                    minuteAverages[i] = sum / validReadingCount;
                    Serial.printf("  - Avg for %s: %.2f°C (%d readings)\n", sensors[i].name, minuteAverages[i], validReadingCount);
                } else {
                    minuteAverages[i] = NAN; // No valid readings this minute
                    Serial.printf("  - Avg for %s: FAILED (0 readings)\n", sensors[i].name);
                }
            }

            // Step 2: Fuse the averaged readings using the Kalman filter
            float fusedTemp = kalmanFilter.step(minuteAverages);
            currentFusedTemp = fusedTemp;
            Serial.printf("\n*** MINUTE FUSED TEMPERATURE: %.2f°C ***\n", fusedTemp);

            // Step 3: Update EEPROM extremes and log to SD card
            updateFusedEEPROM(fusedTemp);
            for (int i = 0; i < NUM_SENSORS; i++) {
                if (!isnan(minuteAverages[i])) {
                    updateEEPROM(sensors[i], minuteAverages[i]);
                }
            }
            writeToCSV(minuteAverages, fusedTemp); // Log the AVERAGES, not the raw readings

            // Step 4: Reset the index to start collecting for the next minute
            readingIndex = 0;
            Serial.println("\nBuffer reset. Starting new 1-minute cycle.");
        }

        if (consecutiveFailures >= 3) {
            if (recoverI2CBus()) consecutiveFailures = 0;
        }

        if (displayNeedsUpdate) {
            updateDisplay();
        }
    }
}
